[
    {
        "id": "work-experience-playlist-id",
        "title": "Work Experience",
        "description": "My professional journey through different companies",
        "imageUrl": "💼",
        "imagePng": "/png/work-experience.png",
        "songs": [
            {
                "id": "opener",
                "title": "Software Engineer at Opener.",
                "artist": "Sept 2025 - Dec 2025",
                "location": "Toronto, ON",
                "description": "Client-facing features, data ingestion, backened development",
                "mp3Path": "/audio/every_summertime.mp3",
                "imagePng": "/png/opener.png",
                "backgroundAccomplishment": "",
                "technologies": "Hasura, Railway, Langfuse, Stytch, Gadget",
                "languages": "TypeScript, React, Node.js, GraphQL, SQL, APIs",
                "accomplishments": [
                    "Built a TypeScript/React bulk-upload system supporting unlimited store ingestion via BullMQ background jobs and Hasura GraphQL APIs. Implemented a Google Places–driven parsing pipeline to enrich CSV uploads and fully automate store onboarding.",
                    "Built a TypeScript-based activity timeline that centralizes all client interactions—including emails, shipping status updates, stage transitions, and sales-agent notes—offering a clear, end-to-end view of the prospecting and ordering proces for each store.",
                    "Developed the handoff/takeover system that transfers ownership of sales leads between agents and clients. Implemented automated emails, database updates, and the company’s first client-facing CRM tools for managing lead statuses.",
                    "Redesigned the user settings page with OpenAI-driven custom sales emails, configurable follow-up schedules backed by email queues, and stronger validation and error handling for required fields."
                ]
            },
            {
                "id": "missingwealth",
                "title": "Machine Learning Engineer at MissingWealth",
                "artist": "May 2025 - Aug 2025",
                "location": "Toronto, ON",
                "description": "Email classification pipeline in GCP",
                "mp3Path": "/audio/startupxyz-experience.mp3",
                "imagePng": "/png/missingwealth.png",
                "backgroundAccomplishment": "",
                "technologies": "Google Cloud Platform, Vertex AI, Gemini",
                "languages": "Python, Pandas, Scikit-learn, NumPy",
                "accomplishments": [
                    "Deployed a GCP ETL pipeline (Cloud Storage + Python + Vertex AI) that processed and cleaned 50k+ emails for automated triage.",
                    "Built a Gemini-driven zero-/few-shot classifier categorizing emails into four outcomes (Record Found, No Record, More Action Required, Inconclusive) with F1 > 0.90.",
                    "Performed confusion matrix analysis and prompt refinement to improve model robustness.",
                    "Automated the majority of email triage workflows, reducing manual review effort and improving processing consistency."
                ]
            },
            {
                "id": "rbc-datascientist",
                "title": "Data Scientist at RBC",
                "artist": "Jan 2025 - Apr 2025",
                "location": "Toronto, ON",
                "description": "Conversational data analysis, machine learning and classfication models",
                "mp3Path": "/audio/rbc-datascientist.mp3",
                "imagePng": "/png/rbc.png",
                "backgroundAccomplishment": "",
                "technologies": "Liveperson, Postman, Postgres, Armada (DBaas)",
                "languages": "Python, SQL, Pandas, BERTopic, scikit-learn",
                "accomplishments": [
                    "Designed and deployed a production ETL workflow (Python + internal APIs + Postgres) to ingest millions of conversational utterances from RBC’s virtual assistant platform.",
                    "Ran BERTopic models with K-Means and HDBSCAN to discover latent conversational topics behind unhandled bot queries, surfacing recurring failure patterns.",
                    "Automated topic summarization and data augmentation using OpenAI GPT-3.5 to produce high-quality candidate intents and training examples for model retraining.",
                    "Containerized pipelines and deployed on Helios, supporting scheduled runs and reproducible ML environments for ongoing conversation-quality monitoring."
                ]
            },
            {
                "id": "rbc-dataanalyst",
                "title": "Data Analyst at RBC",
                "artist": "May 2024 – Aug 2024",
                "location": "Toronto, ON",
                "description": "Data analytics, reporting, and optimization",
                "mp3Path": "/audio/rbc-dataanalyst.mp3",
                "imagePng": "/png/rbc.png",
                "backgroundAccomplishment": "",
                "technologies": "Superset, SQL",
                "languages": "Python",
                "accomplishments": [
                    "Automated Excel-based processes using Python, pandas, and scheduled scripts, enabling reproducible and error-free workforce tracking workflows.",
                    "Created parameterized SQL models and Superset datasets to support self-serve BI, reducing ad-hoc SQL requests and standardizing metric definitions across teams.",
                    "Developed data validation frameworks with cross-table checks, anomaly rules, and reconciliation logic to maintain high data integrity across 10k+ records.",
                    "Optimized SQL queries and Superset visualizations to reduce load times and improve usability for analytics stakeholders."
                ]
            },
            {
                "id": "toyota-datagovernance",
                "title": "Data Governance Analyst at Toyota Canada",
                "artist": "Sep 2023 – Dec 2023",
                "location": "Toronto, ON",
                "description": "Data quality, dashboards, and automation",
                "mp3Path": "/audio/toyota-datagovernance.mp3",
                "imagePng": "/png/toyota.png",
                "backgroundAccomplishment": "",
                "technologies": "AWS, Power BI, SAP/HANA",
                "languages": "SQL, Python, PyPDF2, Pandas, APIs",
                "accomplishments": [
                    "Delivered data quality and reporting insights by querying, cleansing, and joining enterprise data across multiple SQL tables for various teams.",
                    "Enhanced an internal Python-based résumé parsing tool by optimizing text-classification logic, redesigning the weighting system, and enabling customizable keyword weights for hiring managers—resulting in more accurate and intuitive candidate scoring.",
                    "Implemented a real-time weather analytics dashboard using Power BI, a Python ETL script, and REST API ingestion; automated extraction, transformation, and loading into a SQL database to support operational decision-making."
                ]
            }
        ]
    },
    {
        "id": "personal-projects-playlist-id",
        "title": "Personal Projects",
        "description": "Side projects and creative coding experiments",
        "imageUrl": "🚀",
        "imagePng": "/png/personal-project.png",
        "songs": [
            {
                "id": "portfolio-website-song-id",
                "title": "Portfolio",
                "artist": "React, Node.js",
                "location": "2 weeks",
                "description": "Spotify inspired portfolio website",
                "mp3Path": "/audio/startupxyz-experience.mp3",
                "imagePng": "/png/portfolio.png",
                "backgroundAccomplishment": "",
                "technologies": "Railway, Vercel",
                "languages": "React, Node.js",
                "accomplishments": [
                    "Built a portfolio website using React and Node.js, hosted on Railway and Vercel.",
                    "Curated the user interface to be a spotify inspired portfolio website, with a clean and modern design.",
                    "Implemented a audio player that allows the user to listen to the songs and playlists."
                ]
            },
            {
                "id": "task-management-song-id",
                "title": "Autofill Pro",
                "artist": "Chrome Extension",
                "location": "1 month",
                "description": "Chrome autofill extension for user info and shipping info",
                "mp3Path": "/audio/startupxyz-experience.mp3",
                "imagePng": "/png/chrome.png",
                "backgroundAccomplishment": "",
                "technologies": "Chrome Extension APIs, Chrome Storage API",
                "languages": "JavaScript, HTML, CSS",
                "accomplishments": [
                    "Built a full Chrome extension using Manifest V3 that can automatically detect and fill form fields on almost any website by checking patterns in the HTML, placeholders, and surrounding context.",
                    "Structured the extension like a mini full-stack app, with separate modules for the UI, storage, and form-filling logic — around ~1,000 lines of JavaScript across just three main files.",
                    "Created smart dropdown handling that tries multiple matching strategies (exact text, partial matches, fuzzy logic) and even triggers the right events so sites think the user actually selected the option.",
                    "Designed a smooth, modern UI with tabs, gradients, keyboard shortcuts (Cmd/Ctrl + Shift + F), a right-click context menu, and clear visual cues (like green highlights) when fields are filled — all powered by secure, local-only storage."
                ]
            },
            {
                "id": "weather-dashboard-song-id",
                "title": "SeekSwift",
                "artist": "JavaScript, APIs",
                "location": "1 week",
                "description": "Real-time weather data visualization with interactive charts",
                "mp3Path": "",
                "imagePng": "/png/seekswift.png",
                "backgroundAccomplishment": "",
                "technologies": "",
                "languages": "",
                "accomplishments": []
            },
            {
                "id": "trade-watt-song-id",
                "title": "TradeWatt",
                "artist": "May 2025 – Aug 2025",
                "location": "",
                "description": "Energy market data analysis and price prediction using machine learning",
                "mp3Path": "",
                "imagePng": "/png/tradewatt.png",
                "backgroundAccomplishment": "",
                "technologies": "MongoDB, Neural Networks, Regression, Decision Trees",
                "languages": "Python, Scikit-learn, Pandas, Numpy",
                "accomplishments": [
                    "Built an automated ETL pipeline to ingest, clean, and structure real-time and historical energy market data into MongoDB, enabling consistent and scalable data access for modeling tasks.",
                    "Developed a full machine learning workflow that handled data extraction, preprocessing, feature engineering, and model training for energy price prediction.",
                    "Implemented and compared multiple predictive models—including neural networks, regression approaches, and decision trees—to evaluate performance and optimize model accuracy.",
                    "Ran iterative experimentation and hyperparameter tuning, using performance metrics to refine model selection and improve forecasting quality."
                ]
            },
            {
                "id": "mindful-meals-song-id",
                "title": "MindfulMeals",
                "artist": "Jan 2024 – Apr 2024",
                "location": "",
                "description": "Full-stack recipe management app with personalized dietary filtering and recipe discovery",
                "mp3Path": "",
                "imagePng": "/png/mindfulmeals.png",
                "backgroundAccomplishment": "",
                "technologies": "Firebase, MySqlWorkbench",
                "languages": "Python, JavaScript, React, Node.js, SQL",
                "accomplishments": [
                    "Built a full-stack recipe management app with Firebase authentication, user profiles, and personalized dietary filtering.",
                    "Developed a recipe discovery experience with real-time search, an API-powered recipe finder, and curated filtering for dietary needs and ingredients.",
                    "Implemented core user features including a grocery cart, saved recipe collections, ratings/reviews, and advanced recipe filtering.",
                    "Integrated Firebase + SQL for secure data storage, fast querying, and sync across devices."
                ]
            }
        ]
    },
    {
        "id": "skills-technologies-playlist-id",
        "title": "Skills & Technologies",
        "description": "My technical skills and learning journey",
        "imageUrl": "⚡",
        "imagePng": "/png/skills-technologies.png",
        "songs": [
            {
                "id": "frontend-dev-song-id",
                "title": "Frontend Development",
                "artist": "React, Vue.js, TypeScript",
                "location": "3+ years",
                "description": "Building responsive and interactive user interfaces",
                "mp3Path": "",
                "imagePng": "/png/frontend-dev.png",
                "backgroundAccomplishment": "",
                "technologies": "React, Vue.js, Redux, Next.js, Vite, Webpack",
                "languages": "TypeScript, JavaScript, HTML, CSS, JSX",
                "accomplishments": [
                    "Developed responsive web applications using React and Vue.js with TypeScript for type safety and improved code quality.",
                    "Built reusable component libraries and implemented state management solutions using Redux and Context API.",
                    "Optimized frontend performance through code splitting, lazy loading, and efficient rendering techniques.",
                    "Created accessible user interfaces following WCAG guidelines and implemented responsive designs for mobile and desktop."
                ]
            },
            {
                "id": "backend-dev-song-id",
                "title": "Backend Development",
                "artist": "Node.js, Python, Java",
                "location": "2+ years",
                "description": "Server-side development and API design",
                "mp3Path": "",
                "imagePng": "/png/backend-dev.png",
                "backgroundAccomplishment": "",
                "technologies": "Express.js, Flask, Spring Boot, REST APIs, GraphQL, Docker",
                "languages": "Node.js, Python, Java, SQL",
                "accomplishments": [
                    "Designed and implemented RESTful APIs and GraphQL endpoints for scalable web applications.",
                    "Built microservices architecture using Node.js and Python with proper error handling and logging.",
                    "Developed authentication and authorization systems using JWT tokens and OAuth 2.0.",
                    "Optimized database queries and implemented caching strategies to improve API response times."
                ]
            },
            {
                "id": "database-mgmt-song-id",
                "title": "Database Management",
                "artist": "MongoDB, PostgreSQL",
                "location": "2+ years",
                "description": "Data modeling and database optimization",
                "mp3Path": "",
                "imagePng": "/png/database-mgmt.png",
                "backgroundAccomplishment": "",
                "technologies": "MongoDB, PostgreSQL, Redis, SQL Server, Mongoose, Prisma",
                "languages": "SQL, NoSQL, Python, JavaScript",
                "accomplishments": [
                    "Designed and implemented database schemas for both relational and NoSQL databases, ensuring data integrity and optimal performance.",
                    "Optimized database queries and created indexes to improve query performance and reduce response times.",
                    "Implemented database migrations and version control for schema changes across development and production environments.",
                    "Set up database replication and backup strategies to ensure data availability and disaster recovery."
                ]
            }
        ]
    },
    {
        "id": "hobbies-and-interests-playlist-id",
        "title": "Hobbies and Interests",
        "description": "Things I enjoy doing in my free time and activities that keep me inspired and motivated",
        "imageUrl": "🎯",
        "imagePng": "/png/hobbies.png",
        "songs": [
            {
                "id": "photography-hobby",
                "title": "Photography",
                "artist": "Creative",
                "location": "",
                "description": "Capturing moments and exploring different perspectives through the lens. Love experimenting with different lighting, compositions, and editing techniques.",
                "mp3Path": "",
                "imagePng": "/png/photography.png",
                "backgroundAccomplishment": "",
                "technologies": "Adobe Lightroom, Photoshop, Camera Equipment",
                "languages": "",
                "accomplishments": [
                    "Developed skills in portrait, landscape, and street photography through consistent practice and experimentation.",
                    "Mastered manual camera settings and composition techniques including rule of thirds, leading lines, and depth of field.",
                    "Created a portfolio of edited photographs showcasing various styles and techniques.",
                    "Explored different photography genres and continuously learning new editing workflows and post-processing techniques."
                ]
            },
            {
                "id": "reading-hobby",
                "title": "Reading",
                "artist": "Learning",
                "location": "",
                "description": "Avid reader of technology books, science fiction, and personal development. Always have a book in progress.",
                "mp3Path": "",
                "imagePng": "/png/reading.png",
                "backgroundAccomplishment": "",
                "technologies": "",
                "languages": "",
                "accomplishments": [
                    "Read extensively across multiple genres including technology, science fiction, and personal development literature.",
                    "Maintained a consistent reading habit, completing numerous books on software engineering, system design, and career growth.",
                    "Applied insights from technical books to improve coding practices and problem-solving approaches.",
                    "Explored diverse perspectives through fiction and non-fiction, expanding knowledge and critical thinking skills."
                ]
            },
            {
                "id": "hiking-hobby",
                "title": "Hiking & Nature",
                "artist": "Outdoor",
                "location": "",
                "description": "Enjoy exploring trails and spending time outdoors. Great way to disconnect and recharge while staying active.",
                "mp3Path": "",
                "imagePng": "/png/hiking.png",
                "backgroundAccomplishment": "",
                "technologies": "",
                "languages": "",
                "accomplishments": [
                    "Completed numerous hiking trails of varying difficulty levels, building endurance and appreciation for nature.",
                    "Explored diverse landscapes including mountains, forests, and coastal trails across different regions.",
                    "Developed navigation skills using maps, GPS, and trail markers for safe outdoor adventures.",
                    "Found hiking to be an excellent way to maintain physical fitness while providing mental clarity and stress relief."
                ]
            },
            {
                "id": "cooking-hobby",
                "title": "Cooking",
                "artist": "Creative",
                "location": "",
                "description": "Love experimenting with new recipes and cuisines. Cooking is both creative and relaxing for me.",
                "mp3Path": "",
                "imagePng": "/png/cooking.png",
                "backgroundAccomplishment": "",
                "technologies": "",
                "languages": "",
                "accomplishments": [
                    "Experimented with various cuisines including Italian, Asian, and Mediterranean cooking styles.",
                    "Mastered fundamental cooking techniques including knife skills, sautéing, roasting, and baking.",
                    "Developed the ability to modify recipes and create original dishes based on available ingredients.",
                    "Found cooking to be a creative outlet that combines technical skills with artistic expression and provides a relaxing break from work."
                ]
            },
            {
                "id": "gaming-hobby",
                "title": "Gaming",
                "artist": "Entertainment",
                "location": "",
                "description": "Enjoy strategy games and puzzle games. Appreciate good game design and storytelling in video games.",
                "mp3Path": "",
                "imagePng": "/png/gaming.png",
                "backgroundAccomplishment": "",
                "technologies": "",
                "languages": "",
                "accomplishments": [
                    "Played and analyzed various strategy and puzzle games, appreciating well-designed game mechanics and narratives.",
                    "Studied game design principles and user experience patterns that translate to software development.",
                    "Enjoyed multiplayer gaming experiences that require teamwork, communication, and strategic thinking.",
                    "Found gaming to be an engaging way to unwind while also learning about interactive design and problem-solving."
                ]
            },
            {
                "id": "learning-tech-hobby",
                "title": "Learning New Technologies",
                "artist": "Professional",
                "location": "",
                "description": "Passionate about staying up-to-date with the latest tech trends. Love exploring new frameworks, tools, and programming languages.",
                "mp3Path": "",
                "imagePng": "/png/learning.png",
                "backgroundAccomplishment": "",
                "technologies": "Various Frameworks, Tools, Cloud Platforms",
                "languages": "Multiple Programming Languages",
                "accomplishments": [
                    "Continuously learning new programming languages, frameworks, and tools to stay current with industry trends.",
                    "Completed online courses and tutorials on emerging technologies including cloud computing, machine learning, and modern web frameworks.",
                    "Built side projects to practice and experiment with new technologies before applying them in professional settings.",
                    "Maintained a growth mindset and actively seek out learning opportunities through documentation, tutorials, and hands-on experimentation."
                ]
            }
        ]
    }
]